# стр 64. Таблица 11-3. Индивидуальные показатели концентраций амлодипина (нг/мл) после однократного приема исследуемого препарата Телсартан ®
# стр 71. Таблица 11-5. Индивидуальные показатели концентраций амлодипина (нг/мл) после однократного приема референтного препарата Твинста ®

# стр 152 Таблица  11-19.  Индивидуальные  показатели  AUC0-t  амлодипина  (нг×ч/мл)  после 
# однократного приема исследуемого препарата Телсартан ®

cat1 <- c(0, 0, 0.4, 1.19, 1.67, 2.16, 2.21, 2.84, 3.39, 5.75, 4.24, 4.16, 4.54, 4.75, 4.5, 4.69, 4.36, 4.31, 4.21, 4.22, 2.81, 2.69, 2.05, 1.12, 0.69, 0.5, 0.28, 0)
car1 <- c(0, 0.21, 0.89, 1.18, 2.16, 2.68, 2.78, 3.35, 3.79, 6.03, 6.29, 6.68, 6.14, 5.99, 5.88, 5.9, 5.79, 5.52, 5.12, 4.11, 3.84, 2.99, 2.25, 1.45, 0.8, 0.48, 0.31, 0)
cat2 <- c(0, 0, 0.82, 1.61, 2.84, 2.79, 3.29, 3.61, 4.36, 4.91, 5.57, 5.09, 5.25, 5.23, 5.14, 4.9, 4.9, 4.87, 5.13, 4.33, 3.77, 3.06, 2.36, 1.43, 1.01, 0.63, 0.43, 0.24)
car2 <- c(0, 0, 0.69, 1.5, 1.45, 2.92, 3.53, 4.27, 3.66, 7.14, 5.36, 5.57, 6.52, 5.99, 5.79, 5.34, 5.58, 5.37, 5.17, 4.35, 4.7, 3.23, 2.56, 1.87, 1.18, 0.61, 0.47, 0.28)

indata <- data.frame(id = rep(1:2, each=56),
                     group = rep(c("T", "R"), each=28),
                     time = c(0, 0.25, 0.5, 0.75, 1, 1.25, 1.5, 2, 3, 4, 5, 6, 7, 7.5, 8, 8.5, 9, 10, 12, 16, 24, 36, 48, 72, 96, 120, 144, 168),
                     conc = c(cat1, car1, cat2, car2))
dataT <- subset(indata, code == "T")
# res1 <- auc(conc=dataT$conc, time=dataT$time, design='complete', method='t')
res2 <- auc.complete(data = indata)
print(res2)
plot(res2)


conc <- c(0, 0, 0.4, 1.19, 1.67, 2.16, 2.21, 2.84, 3.39, 5.75, 4.24, 4.16, 4.54, 4.75, 4.5, 4.69, 4.36, 4.31, 4.21, 4.22, 2.81, 2.69, 2.05, 1.12, 0.69, 0.5, 0.28, 0)
time <- c(0, 0.25, 0.5, 0.75, 1, 1.25, 1.5, 2, 3, 4, 5, 6, 7, 7.5, 8, 8.5, 9, 10, 12, 16, 24, 36, 48, 72, 96, 120, 144, 168)
# как у нас
install.packages("PK")
library("PK", lib.loc="~/R/win-library/3.5")
auc1 <- auc(conc=conc,  time=time,  method="t",  design="complete")
print(auc1)
summary(auc1)
plot(auc1)

# как в отчете
install.packages("PKNCA")
library("PKNCA", lib.loc="~/R/win-library/3.5")
auc21 <- pk.calc.auc(conc, time)
# auc22 <- pk.calc.auc(conc, time, method="linear")

data("Rats")
data("Glucose")
data1 <- subset(Glucose, date==1)
data2 <- subset(Glucose, date==2)
res1 <- auc(conc=data1$conc, time=data1$time, design='complete', method='t')
print(res1)
data1$conc
